[
    {
      "id":1,
      "company": "Google",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "2",
      "logo": "https://i.ibb.co/tBxNDHJ/google-1-1-1-1.png",
      "jobTitle": "Software Engineer",
      "location": "Mountain View, CA",
      "salary": "$150,000 - $200,000",
      "isRemote": "remote",
      "jobDescription": "Google is seeking a talented software engineer to join our team and help build the next generation of our search engine. The ideal candidate will have experience with large-scale distributed systems, as well as a deep understanding of algorithms and data structures.",
      "jobResponsibilities": [
        "Design, develop, and test software systems that power Google's products and services",
        "Collaborate with cross-functional teams to identify and solve complex engineering problems",
        "Write clean, efficient, and well-documented code that follows best practices and coding standards",
        "Perform code reviews and provide feedback to other engineers",
        "Participate in the entire software development lifecycle, from requirements gathering to deployment and maintenance",
        "Develop and maintain engineering documentation and specifications",
        "Ensure the performance, scalability, and reliability of software systems",
        "Stay up-to-date with new technologies, tools, and programming languages",
        "Contribute to the development of best practices, coding standards, and software engineering processes",
        "Mentor junior engineers and participate in technical interviews"
      ],
      "contactPhone": "555-123-4567",
      "contactEmail": "jobs@google.com"
    },
    {
      "id":2,
      "company": "Tesla",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "4",
      "logo": "https://i.ibb.co/vDDcLtX/tesla-9-1.png",
      "jobTitle": "Mechanical Engineer",
      "location": "Fremont, CA",
      "salary": "$120,000 - $140,000",
      "isRemote": "onsite",
      "jobDescription": "Tesla is seeking a mechanical engineer to join our vehicle engineering team and help design and develop new electric vehicles. The ideal candidate will have experience with CAD software, as well as a strong background in thermodynamics and fluid mechanics.",
      "jobResponsibilities": [
        "Design, develop, and test mechanical components and systems for electric vehicles",
        "Collaborate with cross-functional teams to ensure seamless integration of mechanical components with electrical, software, and manufacturing systems",
        "Perform engineering calculations and simulations to evaluate the performance, reliability, and safety of mechanical designs",
        "Prototype and test new ideas and concepts using a variety of tools and techniques",
        "Develop and maintain engineering documentation and specifications",
        "Drive continuous improvement of engineering processes and workflows",
        "Stay up-to-date with new technologies, materials, and manufacturing processes",
        "Participate in design reviews and provide feedback to other engineers",
        "Mentor junior engineers and provide guidance on mechanical engineering principles and practices"
      ],
      "contactPhone": "555-987-6543",
      "contactEmail": "jobs@tesla.com"
    },
    {
      "id":3,
      "company": "Netflix",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "10",
      "logo": "https://i.ibb.co/mRZY34y/netflix-4-1.png",
      "jobTitle": "Senior Software Engineer - UI Platform",
      "location": "Los Gatos, CA",
      "salary": "$140,000 - $160,000",
      "isRemote": "remote",
      "jobDescription": "We are seeking a Senior Software Engineer to join our UI Platform team, responsible for developing and maintaining a suite of UI components and tools used across the Netflix application stack. In this role, you will work closely with cross-functional teams to design and implement scalable, maintainable solutions that enhance the Netflix user experience.",
      "jobResponsibilities": [
        "Design and develop high-quality UI components and tools used by teams across the Netflix application stack",
        "Collaborate with cross-functional teams to understand requirements and ensure solutions meet business needs",
        "Write clean, maintainable code that is well-documented and thoroughly tested",
        "Stay up-to-date with emerging UI development technologies and trends",
        "Communicate findings and recommendations to stakeholders and senior leadership",
        "Participate in code reviews and provide feedback to other team members",
        "Contribute to the development of best practices, coding standards, and data science processes"
      ],
      "contactPhone": "555-555-1212",
      "contactEmail": "jobs@facebook.com"
    },
    {
      "id":4,
      "company": "Apple",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "6",
      "logo": "https://i.ibb.co/TMQ4pSg/download-3.png",
      "jobTitle": "iOS Developer",
      "location": "Cupertino, CA",
      "salary": "$120,000 - $150,000",
      "isRemote": "onsite",
      "jobDescription": "Apple is seeking an experienced iOS developer to join our team and help us build the next generation of mobile applications. The ideal candidate will have experience with Swift and Objective-C, as well as a strong understanding of iOS development best practices.",
      "jobResponsibilities": [
        "Design and develop high-quality, scalable iOS applications",
        "Collaborate with cross-functional teams to define, design, and ship new features",
        "Write clean, maintainable, and well-documented code",
        "Ensure the performance, quality, and responsiveness of applications",
        "Identify and fix bugs and performance bottlenecks",
        "Work with designers to implement and maintain a cohesive visual style and user experience",
        "Stay up-to-date with new technologies, frameworks, and trends in iOS development",
        "Contribute to the development of best practices, coding standards, and software development processes",
        "Mentor junior developers and participate in code reviews"
      ],
      "contactPhone": "555-555-5555",
      "contactEmail": "jobs@apple.com"
    },
    {
      "id":5,
      "company": "Microsoft",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "9",
      "logo": "https://i.ibb.co/0qTMspz/microsoft-vector-logo.png",
      "jobTitle": "Cloud Solutions Architect",
      "location": "Redmond, WA",
      "salary": "$140,000 - $170,000",
      "isRemote": "remote",
      "jobDescription": "Microsoft is seeking a cloud solutions architect to join our team and help us design and implement cloud-based solutions for our enterprise customers. The ideal candidate will have experience with Azure, AWS, or Google Cloud Platform, as well as a strong background in enterprise architecture.",
      "jobResponsibilities": [
        "Lead the development and launch of new products and features.",
        "Define product requirements and specifications.",
        "Collaborate with cross-functional teams to ensure product success.",
        "Develop product roadmaps and timelines.",
        "Analyze market trends and competition.",
        "Drive product adoption and revenue growth.",
        "Communicate product vision and strategy to stakeholders.",
        "Monitor and report on product performance."
      ],
      "contactPhone": "555-555-1234",
      "contactEmail": "jobs@microsoft.com"
    },
    {
      "id":6,
      "company": "Salesforce",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "11",
      "logo": "https://i.ibb.co/P6mKxt4/download-2.png",
      "jobTitle": "Sales Manager",
      "location": "San Francisco, CA",
      "salary": "$130,000 - $160,000",
      "isRemote": "onsite",
      "jobDescription": "Salesforce is seeking an experienced sales manager to lead a team of account executives and drive revenue growth. The ideal candidate will have experience in enterprise software sales, as well as strong leadership and communication skills.",
      "jobResponsibilities": [
        "Develop and execute sales strategy",
        "Lead and mentor a team of account executives",
        "Collaborate with other departments to achieve revenue goals",
        "Build and maintain relationships with key clients",
        "Analyze and report on sales performance"
      ],
      "contactPhone": "555-123-4567",
      "contactEmail": "jobs@salesforce.com"
    },
    {
      "id":7,
      "company": "Uber",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "13",
      "logo": "https://i.ibb.co/Bcst6BK/download.png",
      "jobTitle": "Senior Software Engineer",
      "location": "San Francisco, CA",
      "salary": "$150,000 - $180,000",
      "isRemote": "remote",
      "jobDescription": "Uber is seeking a senior software engineer to help us build the next generation of our ride-hailing platform. The ideal candidate will have experience with distributed systems, as well as a deep understanding of computer science fundamentals.",
      "jobResponsibilities": [
        "Design and develop scalable and reliable distributed systems.",
        "Collaborate with cross-functional teams to deliver high-quality software.",
        "Contribute to architecture and design decisions.",
        "Write clean, maintainable, and well-tested code.",
        "Troubleshoot and debug complex issues.",
        "Stay up-to-date with emerging technologies and trends.",
        "Provide technical guidance and mentorship to junior engineers.",
        "Participate in code reviews and contribute to team processes."
      ],
      "contactPhone": "555-555-1212",
      "contactEmail": "jobs@uber.com"
    },
    {
      "id":8,
      "company": "Amazon",
      "educationalRequirements": "Bachelor degree to complete any reputational university.",
      "experiences": "1",
      "logo": "https://i.ibb.co/ZHPXLbt/download-1.png",
      "jobTitle": "Operations Manager",
      "location": "Seattle, WA",
      "salary": "$120,000 - $150,000",
      "isRemote": "remote",
      "jobDescription": "Amazon is seeking an experienced operations manager to oversee day-to-day operations and drive improvements in efficiency and productivity. The ideal candidate will have experience managing large teams, as well as a background in supply chain management or logistics.",
      "jobResponsibilities": [
        "Oversee the daily operations of a large team.",
        "Develop and implement strategies to improve efficiency and productivity.",
        "Collaborate with other departments to ensure smooth operations.",
        "Analyze data and metrics to identify areas for improvement.",
        "Provide leadership and guidance to team members.",
        "Ensure compliance with company policies and procedures.",
        "Identify and address operational issues in a timely manner.",
        "Prepare and present reports to senior management."
      ],
      "contactPhone": "555-123-4567",
      "contactEmail": "jobs@amazon.com"
    }
  ]